InformationRegisters/ПараметрыРегламентныхЗаданийРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРегламентныхЗаданийРасширения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РегламентныеЗаданияРасширения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РегламентныеЗаданияРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РегламентныеЗаданияРасширения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаВыписокИзКлиентБанка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПараметрыРегламентныхЗаданийРасширения/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура Расписание(Команда)
	Расписание = НайтиРасписание();
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание); // создаем диалог
	//Если Диалог.ОткрытьМодально(Диалог.Расписание) Тогда // открываем, настраиваем
	//	СохранитьРасписание(Диалог.Расписание);
	//	//Расписание = Диалог.Расписание; //получаем расписание и дальше делаем с ним что угодно
	//КонецЕсли
	Диалог.Показать(Новый ОписаниеОповещения("ПоказатьДиалогЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));		
КонецПроцедуры

&НаСервере
Функция НайтиРасписание()
	
	ЗаписьРегистра = РегистрыСведений.ПараметрыРегламентныхЗаданийРасширения.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.РегламентноеЗадание= Перечисления.РегламентныеЗаданияРасширения.ЗагрузкаВыписокИзКлиентБанка;
	ЗаписьРегистра.Прочитать();
	Если ЗаписьРегистра.Выбран() Тогда
		Расписание = ЗаписьРегистра.Расписание.Получить();
	Иначе
		Расписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Возврат Расписание;
	
КонецФункции // НайтиРасписание()

&НаКлиенте
Процедура ПоказатьДиалогЗавершение(Расписание,ДополнительныеПараметры) Экспорт 
	СохранитьРасписание(Расписание);
КонецПроцедуры

&НаСервере
Процедура СохранитьРасписание(Расписание)
	АдресВременногоХранилищаРасписания = ПоместитьВоВременноеХранилище(Расписание, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(АдресВременногоХранилищаРасписания) Тогда
        
        ТекущийОбъект.Расписание
            = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилищаРасписания));
        
    КонецЕсли;    
    
КонецПроцедуры
